Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UEPxCLR : (USB Offset: 0x04) (R/W 32)  -------- */
#define USB_UEPxCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEPxCLR)   Reset Value */

#define USB_UEPxCLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEPxCLR) Register Mask  */


/* -------- USB_UEPxSET : (USB Offset: 0x08) (R/W 32)  -------- */
#define USB_UEPxSET_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEPxSET)   Reset Value */

#define USB_UEPxSET_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEPxSET) Register Mask  */


/* -------- USB_UEPxINV : (USB Offset: 0x0C) (R/W 32)  -------- */
#define USB_UEPxINV_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UEPxINV)   Reset Value */

#define USB_UEPxINV_Msk                       _UINT32_(0x00000000)                                 /* (USB_UEPxINV) Register Mask  */


/* -------- USB_UOTGIR : (USB Offset: 0x40) (R/W 32) USB OTG Interrupt Status Register -------- */
#define USB_UOTGIR_AVBUS_VLD_Pos              _UINT32_(0)                                          /* (USB_UOTGIR) A-VBUS change indicator bit Position */
#define USB_UOTGIR_AVBUS_VLD_Msk              (_UINT32_(0x1) << USB_UOTGIR_AVBUS_VLD_Pos)          /* (USB_UOTGIR) A-VBUS change indicator bit Mask */
#define USB_UOTGIR_AVBUS_VLD(value)           (USB_UOTGIR_AVBUS_VLD_Msk & (_UINT32_(value) << USB_UOTGIR_AVBUS_VLD_Pos)) /* Assignment of value for AVBUS_VLD in the USB_UOTGIR register */
#define   USB_UOTGIR_AVBUS_VLD_CHANGE_Val     _UINT32_(0x1)                                        /* (USB_UOTGIR) Change on usb_a_vbus_vld input detected  */
#define   USB_UOTGIR_AVBUS_VLD_NO_CHANGE_Val  _UINT32_(0x0)                                        /* (USB_UOTGIR) No change on usb_a_vbus_vld input detected  */
#define USB_UOTGIR_AVBUS_VLD_CHANGE           (USB_UOTGIR_AVBUS_VLD_CHANGE_Val << USB_UOTGIR_AVBUS_VLD_Pos) /* (USB_UOTGIR) Change on usb_a_vbus_vld input detected Position */
#define USB_UOTGIR_AVBUS_VLD_NO_CHANGE        (USB_UOTGIR_AVBUS_VLD_NO_CHANGE_Val << USB_UOTGIR_AVBUS_VLD_Pos) /* (USB_UOTGIR) No change on usb_a_vbus_vld input detected Position */
#define USB_UOTGIR_BSESS_END_Pos              _UINT32_(2)                                          /* (USB_UOTGIR) B-Device VBUS change indicator bit Position */
#define USB_UOTGIR_BSESS_END_Msk              (_UINT32_(0x1) << USB_UOTGIR_BSESS_END_Pos)          /* (USB_UOTGIR) B-Device VBUS change indicator bit Mask */
#define USB_UOTGIR_BSESS_END(value)           (USB_UOTGIR_BSESS_END_Msk & (_UINT32_(value) << USB_UOTGIR_BSESS_END_Pos)) /* Assignment of value for BSESS_END in the USB_UOTGIR register */
#define   USB_UOTGIR_BSESS_END_CHANGE_Val     _UINT32_(0x1)                                        /* (USB_UOTGIR) Change on usb_b_sess_end input detected  */
#define   USB_UOTGIR_BSESS_END_NO_CHANGED_Val _UINT32_(0x0)                                        /* (USB_UOTGIR) No change on usb_b_sess_end input detected  */
#define USB_UOTGIR_BSESS_END_CHANGE           (USB_UOTGIR_BSESS_END_CHANGE_Val << USB_UOTGIR_BSESS_END_Pos) /* (USB_UOTGIR) Change on usb_b_sess_end input detected Position */
#define USB_UOTGIR_BSESS_END_NO_CHANGED       (USB_UOTGIR_BSESS_END_NO_CHANGED_Val << USB_UOTGIR_BSESS_END_Pos) /* (USB_UOTGIR) No change on usb_b_sess_end input detected Position */
#define USB_UOTGIR_SESVDIF_Pos                _UINT32_(3)                                          /* (USB_UOTGIR) Session Valid Change Indicator bit Position */
#define USB_UOTGIR_SESVDIF_Msk                (_UINT32_(0x1) << USB_UOTGIR_SESVDIF_Pos)            /* (USB_UOTGIR) Session Valid Change Indicator bit Mask */
#define USB_UOTGIR_SESVDIF(value)             (USB_UOTGIR_SESVDIF_Msk & (_UINT32_(value) << USB_UOTGIR_SESVDIF_Pos)) /* Assignment of value for SESVDIF in the USB_UOTGIR register */
#define   USB_UOTGIR_SESVDIF_CHANGE_Val       _UINT32_(0x1)                                        /* (USB_UOTGIR) Change on usb_sess_vld input detected  */
#define   USB_UOTGIR_SESVDIF_NO_CHANGED_Val   _UINT32_(0x0)                                        /* (USB_UOTGIR) No change on usb_sess_vld input detected  */
#define USB_UOTGIR_SESVDIF_CHANGE             (USB_UOTGIR_SESVDIF_CHANGE_Val << USB_UOTGIR_SESVDIF_Pos) /* (USB_UOTGIR) Change on usb_sess_vld input detected Position */
#define USB_UOTGIR_SESVDIF_NO_CHANGED         (USB_UOTGIR_SESVDIF_NO_CHANGED_Val << USB_UOTGIR_SESVDIF_Pos) /* (USB_UOTGIR) No change on usb_sess_vld input detected Position */
#define USB_UOTGIR_ACTVIF_Pos                 _UINT32_(4)                                          /* (USB_UOTGIR) Bus Activity Indicator bit Position */
#define USB_UOTGIR_ACTVIF_Msk                 (_UINT32_(0x1) << USB_UOTGIR_ACTVIF_Pos)             /* (USB_UOTGIR) Bus Activity Indicator bit Mask */
#define USB_UOTGIR_ACTVIF(value)              (USB_UOTGIR_ACTVIF_Msk & (_UINT32_(value) << USB_UOTGIR_ACTVIF_Pos)) /* Assignment of value for ACTVIF in the USB_UOTGIR register */
#define   USB_UOTGIR_ACTVIF_DETECT_Val        _UINT32_(0x1)                                        /* (USB_UOTGIR) Activity on the D+, D-, ID, or VBus lines has been detected  */
#define   USB_UOTGIR_ACTVIF_NO_DETECT_Val     _UINT32_(0x0)                                        /* (USB_UOTGIR) Active has not been detected  */
#define USB_UOTGIR_ACTVIF_DETECT              (USB_UOTGIR_ACTVIF_DETECT_Val << USB_UOTGIR_ACTVIF_Pos) /* (USB_UOTGIR) Activity on the D+, D-, ID, or VBus lines has been detected Position */
#define USB_UOTGIR_ACTVIF_NO_DETECT           (USB_UOTGIR_ACTVIF_NO_DETECT_Val << USB_UOTGIR_ACTVIF_Pos) /* (USB_UOTGIR) Active has not been detected Position */
#define USB_UOTGIR_LSTATEIF_Pos               _UINT32_(5)                                          /* (USB_UOTGIR) Line State Stable Indicator bit Position */
#define USB_UOTGIR_LSTATEIF_Msk               (_UINT32_(0x1) << USB_UOTGIR_LSTATEIF_Pos)           /* (USB_UOTGIR) Line State Stable Indicator bit Mask */
#define USB_UOTGIR_LSTATEIF(value)            (USB_UOTGIR_LSTATEIF_Msk & (_UINT32_(value) << USB_UOTGIR_LSTATEIF_Pos)) /* Assignment of value for LSTATEIF in the USB_UOTGIR register */
#define   USB_UOTGIR_LSTATEIF_STABLE_Val      _UINT32_(0x1)                                        /* (USB_UOTGIR) USB line state has been stable for 1ms  */
#define   USB_UOTGIR_LSTATEIF_NOT_STABLE_Val  _UINT32_(0x0)                                        /* (USB_UOTGIR) USB line state has not been stable for 1ms  */
#define USB_UOTGIR_LSTATEIF_STABLE            (USB_UOTGIR_LSTATEIF_STABLE_Val << USB_UOTGIR_LSTATEIF_Pos) /* (USB_UOTGIR) USB line state has been stable for 1ms Position */
#define USB_UOTGIR_LSTATEIF_NOT_STABLE        (USB_UOTGIR_LSTATEIF_NOT_STABLE_Val << USB_UOTGIR_LSTATEIF_Pos) /* (USB_UOTGIR) USB line state has not been stable for 1ms Position */
#define USB_UOTGIR_T1MSECIF_Pos               _UINT32_(6)                                          /* (USB_UOTGIR) 1 Millisecond Timer bit Position */
#define USB_UOTGIR_T1MSECIF_Msk               (_UINT32_(0x1) << USB_UOTGIR_T1MSECIF_Pos)           /* (USB_UOTGIR) 1 Millisecond Timer bit Mask */
#define USB_UOTGIR_T1MSECIF(value)            (USB_UOTGIR_T1MSECIF_Msk & (_UINT32_(value) << USB_UOTGIR_T1MSECIF_Pos)) /* Assignment of value for T1MSECIF in the USB_UOTGIR register */
#define   USB_UOTGIR_T1MSECIF_EXPIRE_Val      _UINT32_(0x1)                                        /* (USB_UOTGIR) 1ms timer has expired  */
#define   USB_UOTGIR_T1MSECIF_NOT_EXPIRE_Val  _UINT32_(0x0)                                        /* (USB_UOTGIR) 1ms timer has not expired  */
#define USB_UOTGIR_T1MSECIF_EXPIRE            (USB_UOTGIR_T1MSECIF_EXPIRE_Val << USB_UOTGIR_T1MSECIF_Pos) /* (USB_UOTGIR) 1ms timer has expired Position */
#define USB_UOTGIR_T1MSECIF_NOT_EXPIRE        (USB_UOTGIR_T1MSECIF_NOT_EXPIRE_Val << USB_UOTGIR_T1MSECIF_Pos) /* (USB_UOTGIR) 1ms timer has not expired Position */
#define USB_UOTGIR_IDIF_Pos                   _UINT32_(7)                                          /* (USB_UOTGIR) ID State Change Indicator bit Position */
#define USB_UOTGIR_IDIF_Msk                   (_UINT32_(0x1) << USB_UOTGIR_IDIF_Pos)               /* (USB_UOTGIR) ID State Change Indicator bit Mask */
#define USB_UOTGIR_IDIF(value)                (USB_UOTGIR_IDIF_Msk & (_UINT32_(value) << USB_UOTGIR_IDIF_Pos)) /* Assignment of value for IDIF in the USB_UOTGIR register */
#define   USB_UOTGIR_IDIF_DETECT_Val          _UINT32_(0x1)                                        /* (USB_UOTGIR) Change in ID state is detected  */
#define   USB_UOTGIR_IDIF_NO_DETECT_Val       _UINT32_(0x0)                                        /* (USB_UOTGIR) No change in ID state is detected  */
#define USB_UOTGIR_IDIF_DETECT                (USB_UOTGIR_IDIF_DETECT_Val << USB_UOTGIR_IDIF_Pos)  /* (USB_UOTGIR) Change in ID state is detected Position */
#define USB_UOTGIR_IDIF_NO_DETECT             (USB_UOTGIR_IDIF_NO_DETECT_Val << USB_UOTGIR_IDIF_Pos) /* (USB_UOTGIR) No change in ID state is detected Position */
#define USB_UOTGIR_Msk                        _UINT32_(0x000000FD)                                 /* (USB_UOTGIR) Register Mask  */


/* -------- USB_UOTGIRCLR : (USB Offset: 0x44) (R/W 32)  -------- */
#define USB_UOTGIRCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIRCLR)   Reset Value */

#define USB_UOTGIRCLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIRCLR) Register Mask  */


/* -------- USB_UOTGIRSET : (USB Offset: 0x48) (R/W 32)  -------- */
#define USB_UOTGIRSET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIRSET)   Reset Value */

#define USB_UOTGIRSET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIRSET) Register Mask  */


/* -------- USB_UOTGIRINV : (USB Offset: 0x4C) (R/W 32)  -------- */
#define USB_UOTGIRINV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIRINV)   Reset Value */

#define USB_UOTGIRINV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIRINV) Register Mask  */


