Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UOTGIE : (USB Offset: 0x50) (R/W 32) USB OTG Interrupt Enable Register -------- */
#define USB_UOTGIE_AVBUS_VLD_Pos              _UINT32_(0)                                          /* (USB_UOTGIE) A- Vbus Valid Interrupt Enable bit Position */
#define USB_UOTGIE_AVBUS_VLD_Msk              (_UINT32_(0x1) << USB_UOTGIE_AVBUS_VLD_Pos)          /* (USB_UOTGIE) A- Vbus Valid Interrupt Enable bit Mask */
#define USB_UOTGIE_AVBUS_VLD(value)           (USB_UOTGIE_AVBUS_VLD_Msk & (_UINT32_(value) << USB_UOTGIE_AVBUS_VLD_Pos)) /* Assignment of value for AVBUS_VLD in the USB_UOTGIE register */
#define   USB_UOTGIE_AVBUS_VLD_ON_Val         _UINT32_(0x1)                                        /* (USB_UOTGIE) A-Vbus valid interrupt is enabled  */
#define   USB_UOTGIE_AVBUS_VLD_OFF_Val        _UINT32_(0x0)                                        /* (USB_UOTGIE) A-Vbus valid interrupt is disabled  */
#define USB_UOTGIE_AVBUS_VLD_ON               (USB_UOTGIE_AVBUS_VLD_ON_Val << USB_UOTGIE_AVBUS_VLD_Pos) /* (USB_UOTGIE) A-Vbus valid interrupt is enabled Position */
#define USB_UOTGIE_AVBUS_VLD_OFF              (USB_UOTGIE_AVBUS_VLD_OFF_Val << USB_UOTGIE_AVBUS_VLD_Pos) /* (USB_UOTGIE) A-Vbus valid interrupt is disabled Position */
#define USB_UOTGIE_BSESS_END_Pos              _UINT32_(2)                                          /* (USB_UOTGIE) B-Session End Interrupt Enable bit Position */
#define USB_UOTGIE_BSESS_END_Msk              (_UINT32_(0x1) << USB_UOTGIE_BSESS_END_Pos)          /* (USB_UOTGIE) B-Session End Interrupt Enable bit Mask */
#define USB_UOTGIE_BSESS_END(value)           (USB_UOTGIE_BSESS_END_Msk & (_UINT32_(value) << USB_UOTGIE_BSESS_END_Pos)) /* Assignment of value for BSESS_END in the USB_UOTGIE register */
#define   USB_UOTGIE_BSESS_END_ON_Val         _UINT32_(0x1)                                        /* (USB_UOTGIE) B-session end interrupt is enabled  */
#define   USB_UOTGIE_BSESS_END_OFF_Val        _UINT32_(0x0)                                        /* (USB_UOTGIE) B-session end interrupt is disabled  */
#define USB_UOTGIE_BSESS_END_ON               (USB_UOTGIE_BSESS_END_ON_Val << USB_UOTGIE_BSESS_END_Pos) /* (USB_UOTGIE) B-session end interrupt is enabled Position */
#define USB_UOTGIE_BSESS_END_OFF              (USB_UOTGIE_BSESS_END_OFF_Val << USB_UOTGIE_BSESS_END_Pos) /* (USB_UOTGIE) B-session end interrupt is disabled Position */
#define USB_UOTGIE_SESS_VLD_Pos               _UINT32_(3)                                          /* (USB_UOTGIE) Session Valid Interrupt Enable bit Position */
#define USB_UOTGIE_SESS_VLD_Msk               (_UINT32_(0x1) << USB_UOTGIE_SESS_VLD_Pos)           /* (USB_UOTGIE) Session Valid Interrupt Enable bit Mask */
#define USB_UOTGIE_SESS_VLD(value)            (USB_UOTGIE_SESS_VLD_Msk & (_UINT32_(value) << USB_UOTGIE_SESS_VLD_Pos)) /* Assignment of value for SESS_VLD in the USB_UOTGIE register */
#define   USB_UOTGIE_SESS_VLD_ON_Val          _UINT32_(0x1)                                        /* (USB_UOTGIE) Session valid interrupt is enabled  */
#define   USB_UOTGIE_SESS_VLD_OFF_Val         _UINT32_(0x0)                                        /* (USB_UOTGIE) Session valid interrupt is disabled  */
#define USB_UOTGIE_SESS_VLD_ON                (USB_UOTGIE_SESS_VLD_ON_Val << USB_UOTGIE_SESS_VLD_Pos) /* (USB_UOTGIE) Session valid interrupt is enabled Position */
#define USB_UOTGIE_SESS_VLD_OFF               (USB_UOTGIE_SESS_VLD_OFF_Val << USB_UOTGIE_SESS_VLD_Pos) /* (USB_UOTGIE) Session valid interrupt is disabled Position */
#define USB_UOTGIE_ACTIVITY_Pos               _UINT32_(4)                                          /* (USB_UOTGIE) Activity Interrupt Enable bit Position */
#define USB_UOTGIE_ACTIVITY_Msk               (_UINT32_(0x1) << USB_UOTGIE_ACTIVITY_Pos)           /* (USB_UOTGIE) Activity Interrupt Enable bit Mask */
#define USB_UOTGIE_ACTIVITY(value)            (USB_UOTGIE_ACTIVITY_Msk & (_UINT32_(value) << USB_UOTGIE_ACTIVITY_Pos)) /* Assignment of value for ACTIVITY in the USB_UOTGIE register */
#define   USB_UOTGIE_ACTIVITY_ON_Val          _UINT32_(0x1)                                        /* (USB_UOTGIE) ACTIVITY interrupt is enabled  */
#define   USB_UOTGIE_ACTIVITY_OFF_Val         _UINT32_(0x0)                                        /* (USB_UOTGIE) ACTIVITY interrupt is disabled  */
#define USB_UOTGIE_ACTIVITY_ON                (USB_UOTGIE_ACTIVITY_ON_Val << USB_UOTGIE_ACTIVITY_Pos) /* (USB_UOTGIE) ACTIVITY interrupt is enabled Position */
#define USB_UOTGIE_ACTIVITY_OFF               (USB_UOTGIE_ACTIVITY_OFF_Val << USB_UOTGIE_ACTIVITY_Pos) /* (USB_UOTGIE) ACTIVITY interrupt is disabled Position */
#define USB_UOTGIE_LSTATE_Pos                 _UINT32_(5)                                          /* (USB_UOTGIE) Line State Interrupt Enable bit Position */
#define USB_UOTGIE_LSTATE_Msk                 (_UINT32_(0x1) << USB_UOTGIE_LSTATE_Pos)             /* (USB_UOTGIE) Line State Interrupt Enable bit Mask */
#define USB_UOTGIE_LSTATE(value)              (USB_UOTGIE_LSTATE_Msk & (_UINT32_(value) << USB_UOTGIE_LSTATE_Pos)) /* Assignment of value for LSTATE in the USB_UOTGIE register */
#define   USB_UOTGIE_LSTATE_ON_Val            _UINT32_(0x1)                                        /* (USB_UOTGIE) Line state interrupt is enabled  */
#define   USB_UOTGIE_LSTATE_OFF_Val           _UINT32_(0x0)                                        /* (USB_UOTGIE) Line state interrupt is disabled  */
#define USB_UOTGIE_LSTATE_ON                  (USB_UOTGIE_LSTATE_ON_Val << USB_UOTGIE_LSTATE_Pos)  /* (USB_UOTGIE) Line state interrupt is enabled Position */
#define USB_UOTGIE_LSTATE_OFF                 (USB_UOTGIE_LSTATE_OFF_Val << USB_UOTGIE_LSTATE_Pos) /* (USB_UOTGIE) Line state interrupt is disabled Position */
#define USB_UOTGIE_ONE_MSEC_Pos               _UINT32_(6)                                          /* (USB_UOTGIE) 1 Millisecond Timer Interrupt Enable bit Position */
#define USB_UOTGIE_ONE_MSEC_Msk               (_UINT32_(0x1) << USB_UOTGIE_ONE_MSEC_Pos)           /* (USB_UOTGIE) 1 Millisecond Timer Interrupt Enable bit Mask */
#define USB_UOTGIE_ONE_MSEC(value)            (USB_UOTGIE_ONE_MSEC_Msk & (_UINT32_(value) << USB_UOTGIE_ONE_MSEC_Pos)) /* Assignment of value for ONE_MSEC in the USB_UOTGIE register */
#define   USB_UOTGIE_ONE_MSEC_ON_Val          _UINT32_(0x1)                                        /* (USB_UOTGIE) 1 millisecond timer interrupt is enabled  */
#define   USB_UOTGIE_ONE_MSEC_OFF_Val         _UINT32_(0x0)                                        /* (USB_UOTGIE) 1 millisecond timer interrupt is disabled  */
#define USB_UOTGIE_ONE_MSEC_ON                (USB_UOTGIE_ONE_MSEC_ON_Val << USB_UOTGIE_ONE_MSEC_Pos) /* (USB_UOTGIE) 1 millisecond timer interrupt is enabled Position */
#define USB_UOTGIE_ONE_MSEC_OFF               (USB_UOTGIE_ONE_MSEC_OFF_Val << USB_UOTGIE_ONE_MSEC_Pos) /* (USB_UOTGIE) 1 millisecond timer interrupt is disabled Position */
#define USB_UOTGIE_IDIE_Pos                   _UINT32_(7)                                          /* (USB_UOTGIE) ID Interrupt Enable bit Position */
#define USB_UOTGIE_IDIE_Msk                   (_UINT32_(0x1) << USB_UOTGIE_IDIE_Pos)               /* (USB_UOTGIE) ID Interrupt Enable bit Mask */
#define USB_UOTGIE_IDIE(value)                (USB_UOTGIE_IDIE_Msk & (_UINT32_(value) << USB_UOTGIE_IDIE_Pos)) /* Assignment of value for IDIE in the USB_UOTGIE register */
#define   USB_UOTGIE_IDIE_ON_Val              _UINT32_(0x1)                                        /* (USB_UOTGIE) ID interrupt is enabled  */
#define   USB_UOTGIE_IDIE_OFF_Val             _UINT32_(0x0)                                        /* (USB_UOTGIE) ID interrupt is disabled  */
#define USB_UOTGIE_IDIE_ON                    (USB_UOTGIE_IDIE_ON_Val << USB_UOTGIE_IDIE_Pos)      /* (USB_UOTGIE) ID interrupt is enabled Position */
#define USB_UOTGIE_IDIE_OFF                   (USB_UOTGIE_IDIE_OFF_Val << USB_UOTGIE_IDIE_Pos)     /* (USB_UOTGIE) ID interrupt is disabled Position */
#define USB_UOTGIE_Msk                        _UINT32_(0x000000FD)                                 /* (USB_UOTGIE) Register Mask  */


/* -------- USB_UOTGIECLR : (USB Offset: 0x54) (R/W 32)  -------- */
#define USB_UOTGIECLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UOTGIECLR)   Reset Value */

#define USB_UOTGIECLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UOTGIECLR) Register Mask  */


