Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UOTGCON : (USB Offset: 0x70) (R/W 32) USB OTG Control Register -------- */
#define USB_UOTGCON_VBUSDIS_Pos               _UINT32_(0)                                          /* (USB_UOTGCON) Vbus Discharge Enable bit Position */
#define USB_UOTGCON_VBUSDIS_Msk               (_UINT32_(0x1) << USB_UOTGCON_VBUSDIS_Pos)           /* (USB_UOTGCON) Vbus Discharge Enable bit Mask */
#define USB_UOTGCON_VBUSDIS(value)            (USB_UOTGCON_VBUSDIS_Msk & (_UINT32_(value) << USB_UOTGCON_VBUSDIS_Pos)) /* Assignment of value for VBUSDIS in the USB_UOTGCON register */
#define   USB_UOTGCON_VBUSDIS_DISCHG_Val      _UINT32_(0x1)                                        /* (USB_UOTGCON) Vbus line is discharged through a pull-down resistor  */
#define   USB_UOTGCON_VBUSDIS_NOT_DISCHG_Val  _UINT32_(0x0)                                        /* (USB_UOTGCON) Vbus line is not discharged through a resistor  */
#define USB_UOTGCON_VBUSDIS_DISCHG            (USB_UOTGCON_VBUSDIS_DISCHG_Val << USB_UOTGCON_VBUSDIS_Pos) /* (USB_UOTGCON) Vbus line is discharged through a pull-down resistor Position */
#define USB_UOTGCON_VBUSDIS_NOT_DISCHG        (USB_UOTGCON_VBUSDIS_NOT_DISCHG_Val << USB_UOTGCON_VBUSDIS_Pos) /* (USB_UOTGCON) Vbus line is not discharged through a resistor Position */
#define USB_UOTGCON_VBUSCHG_Pos               _UINT32_(1)                                          /* (USB_UOTGCON) Vbus Charge Enable bit Position */
#define USB_UOTGCON_VBUSCHG_Msk               (_UINT32_(0x1) << USB_UOTGCON_VBUSCHG_Pos)           /* (USB_UOTGCON) Vbus Charge Enable bit Mask */
#define USB_UOTGCON_VBUSCHG(value)            (USB_UOTGCON_VBUSCHG_Msk & (_UINT32_(value) << USB_UOTGCON_VBUSCHG_Pos)) /* Assignment of value for VBUSCHG in the USB_UOTGCON register */
#define   USB_UOTGCON_VBUSCHG_CHG_Val         _UINT32_(0x1)                                        /* (USB_UOTGCON) Vbus line is charged through a pull-up resistor  */
#define   USB_UOTGCON_VBUSCHG_NOT_CHG_Val     _UINT32_(0x0)                                        /* (USB_UOTGCON) Vbus line is not charged through a resistor  */
#define USB_UOTGCON_VBUSCHG_CHG               (USB_UOTGCON_VBUSCHG_CHG_Val << USB_UOTGCON_VBUSCHG_Pos) /* (USB_UOTGCON) Vbus line is charged through a pull-up resistor Position */
#define USB_UOTGCON_VBUSCHG_NOT_CHG           (USB_UOTGCON_VBUSCHG_NOT_CHG_Val << USB_UOTGCON_VBUSCHG_Pos) /* (USB_UOTGCON) Vbus line is not charged through a resistor Position */
#define USB_UOTGCON_OTGEN_Pos                 _UINT32_(2)                                          /* (USB_UOTGCON) OTG Functionality Enable bit Position */
#define USB_UOTGCON_OTGEN_Msk                 (_UINT32_(0x1) << USB_UOTGCON_OTGEN_Pos)             /* (USB_UOTGCON) OTG Functionality Enable bit Mask */
#define USB_UOTGCON_OTGEN(value)              (USB_UOTGCON_OTGEN_Msk & (_UINT32_(value) << USB_UOTGCON_OTGEN_Pos)) /* Assignment of value for OTGEN in the USB_UOTGCON register */
#define   USB_UOTGCON_OTGEN_ON_Val            _UINT32_(0x1)                                        /* (USB_UOTGCON) DPPULUP  */
#define   USB_UOTGCON_OTGEN_OFF_Val           _UINT32_(0x0)                                        /* (USB_UOTGCON) DPPULUP  */
#define USB_UOTGCON_OTGEN_ON                  (USB_UOTGCON_OTGEN_ON_Val << USB_UOTGCON_OTGEN_Pos)  /* (USB_UOTGCON) DPPULUP Position */
#define USB_UOTGCON_OTGEN_OFF                 (USB_UOTGCON_OTGEN_OFF_Val << USB_UOTGCON_OTGEN_Pos) /* (USB_UOTGCON) DPPULUP Position */
#define USB_UOTGCON_VBUSON_Pos                _UINT32_(3)                                          /* (USB_UOTGCON) Vbus Power-on bit Position */
#define USB_UOTGCON_VBUSON_Msk                (_UINT32_(0x1) << USB_UOTGCON_VBUSON_Pos)            /* (USB_UOTGCON) Vbus Power-on bit Mask */
#define USB_UOTGCON_VBUSON(value)             (USB_UOTGCON_VBUSON_Msk & (_UINT32_(value) << USB_UOTGCON_VBUSON_Pos)) /* Assignment of value for VBUSON in the USB_UOTGCON register */
#define   USB_UOTGCON_VBUSON_ON_Val           _UINT32_(0x1)                                        /* (USB_UOTGCON) Vbus line is powered  */
#define   USB_UOTGCON_VBUSON_OFF_Val          _UINT32_(0x0)                                        /* (USB_UOTGCON) Vbus line is not powered  */
#define USB_UOTGCON_VBUSON_ON                 (USB_UOTGCON_VBUSON_ON_Val << USB_UOTGCON_VBUSON_Pos) /* (USB_UOTGCON) Vbus line is powered Position */
#define USB_UOTGCON_VBUSON_OFF                (USB_UOTGCON_VBUSON_OFF_Val << USB_UOTGCON_VBUSON_Pos) /* (USB_UOTGCON) Vbus line is not powered Position */
#define USB_UOTGCON_DMPULDWN_Pos              _UINT32_(4)                                          /* (USB_UOTGCON) D- Pull-Down Enable bit Position */
#define USB_UOTGCON_DMPULDWN_Msk              (_UINT32_(0x1) << USB_UOTGCON_DMPULDWN_Pos)          /* (USB_UOTGCON) D- Pull-Down Enable bit Mask */
#define USB_UOTGCON_DMPULDWN(value)           (USB_UOTGCON_DMPULDWN_Msk & (_UINT32_(value) << USB_UOTGCON_DMPULDWN_Pos)) /* Assignment of value for DMPULDWN in the USB_UOTGCON register */
#define   USB_UOTGCON_DMPULDWN_ON_Val         _UINT32_(0x1)                                        /* (USB_UOTGCON) D- data line pull-down resistor is enabled  */
#define   USB_UOTGCON_DMPULDWN_OFF_Val        _UINT32_(0x0)                                        /* (USB_UOTGCON) D- data line pull-down resistor is disabled  */
#define USB_UOTGCON_DMPULDWN_ON               (USB_UOTGCON_DMPULDWN_ON_Val << USB_UOTGCON_DMPULDWN_Pos) /* (USB_UOTGCON) D- data line pull-down resistor is enabled Position */
#define USB_UOTGCON_DMPULDWN_OFF              (USB_UOTGCON_DMPULDWN_OFF_Val << USB_UOTGCON_DMPULDWN_Pos) /* (USB_UOTGCON) D- data line pull-down resistor is disabled Position */
#define USB_UOTGCON_DPPULDWN_Pos              _UINT32_(5)                                          /* (USB_UOTGCON) D+ Pull-Down Enable bit Position */
#define USB_UOTGCON_DPPULDWN_Msk              (_UINT32_(0x1) << USB_UOTGCON_DPPULDWN_Pos)          /* (USB_UOTGCON) D+ Pull-Down Enable bit Mask */
#define USB_UOTGCON_DPPULDWN(value)           (USB_UOTGCON_DPPULDWN_Msk & (_UINT32_(value) << USB_UOTGCON_DPPULDWN_Pos)) /* Assignment of value for DPPULDWN in the USB_UOTGCON register */
#define   USB_UOTGCON_DPPULDWN_ON_Val         _UINT32_(0x1)                                        /* (USB_UOTGCON) D+ data line pull-down resistor is enabled  */
#define   USB_UOTGCON_DPPULDWN_OFF_Val        _UINT32_(0x0)                                        /* (USB_UOTGCON) D+ data line pull-down resistor is disabled  */
#define USB_UOTGCON_DPPULDWN_ON               (USB_UOTGCON_DPPULDWN_ON_Val << USB_UOTGCON_DPPULDWN_Pos) /* (USB_UOTGCON) D+ data line pull-down resistor is enabled Position */
#define USB_UOTGCON_DPPULDWN_OFF              (USB_UOTGCON_DPPULDWN_OFF_Val << USB_UOTGCON_DPPULDWN_Pos) /* (USB_UOTGCON) D+ data line pull-down resistor is disabled Position */
#define USB_UOTGCON_DMPULUP_Pos               _UINT32_(6)                                          /* (USB_UOTGCON) D- Pull-Up Enable bit Position */
#define USB_UOTGCON_DMPULUP_Msk               (_UINT32_(0x1) << USB_UOTGCON_DMPULUP_Pos)           /* (USB_UOTGCON) D- Pull-Up Enable bit Mask */
#define USB_UOTGCON_DMPULUP(value)            (USB_UOTGCON_DMPULUP_Msk & (_UINT32_(value) << USB_UOTGCON_DMPULUP_Pos)) /* Assignment of value for DMPULUP in the USB_UOTGCON register */
#define   USB_UOTGCON_DMPULUP_ON_Val          _UINT32_(0x1)                                        /* (USB_UOTGCON) D- data line pull-up resistor is enabled  */
#define   USB_UOTGCON_DMPULUP_OFF_Val         _UINT32_(0x0)                                        /* (USB_UOTGCON) D- data line pull-up resistor is disabled  */
#define USB_UOTGCON_DMPULUP_ON                (USB_UOTGCON_DMPULUP_ON_Val << USB_UOTGCON_DMPULUP_Pos) /* (USB_UOTGCON) D- data line pull-up resistor is enabled Position */
#define USB_UOTGCON_DMPULUP_OFF               (USB_UOTGCON_DMPULUP_OFF_Val << USB_UOTGCON_DMPULUP_Pos) /* (USB_UOTGCON) D- data line pull-up resistor is disabled Position */
#define USB_UOTGCON_DPPULUP_Pos               _UINT32_(7)                                          /* (USB_UOTGCON) D+ Pull-Up Enable bit Position */
#define USB_UOTGCON_DPPULUP_Msk               (_UINT32_(0x1) << USB_UOTGCON_DPPULUP_Pos)           /* (USB_UOTGCON) D+ Pull-Up Enable bit Mask */
#define USB_UOTGCON_DPPULUP(value)            (USB_UOTGCON_DPPULUP_Msk & (_UINT32_(value) << USB_UOTGCON_DPPULUP_Pos)) /* Assignment of value for DPPULUP in the USB_UOTGCON register */
#define   USB_UOTGCON_DPPULUP_ON_Val          _UINT32_(0x1)                                        /* (USB_UOTGCON) D+ data line pull-up resistor is enabled  */
#define   USB_UOTGCON_DPPULUP_OFF_Val         _UINT32_(0x0)                                        /* (USB_UOTGCON) D+ data line pull-up resistor is disabled  */
#define USB_UOTGCON_DPPULUP_ON                (USB_UOTGCON_DPPULUP_ON_Val << USB_UOTGCON_DPPULUP_Pos) /* (USB_UOTGCON) D+ data line pull-up resistor is enabled Position */
#define USB_UOTGCON_DPPULUP_OFF               (USB_UOTGCON_DPPULUP_OFF_Val << USB_UOTGCON_DPPULUP_Pos) /* (USB_UOTGCON) D+ data line pull-up resistor is disabled Position */
#define USB_UOTGCON_Msk                       _UINT32_(0x000000FF)                                 /* (USB_UOTGCON) Register Mask  */


/* -------- USB_UOTGCONCLR : (USB Offset: 0x74) (R/W 32)  -------- */
#define USB_UOTGCONCLR_RESETVALUE             _UINT32_(0x00)                                       /*  (USB_UOTGCONCLR)   Reset Value */

#define USB_UOTGCONCLR_Msk                    _UINT32_(0x00000000)                                 /* (USB_UOTGCONCLR) Register Mask  */


/* -------- USB_UOTGCONSET : (USB Offset: 0x78) (R/W 32)  -------- */
#define USB_UOTGCONSET_RESETVALUE             _UINT32_(0x00)                                       /*  (USB_UOTGCONSET)   Reset Value */

