Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
#define USB_UPWRCINV_Msk                      _UINT32_(0x00000000)                                 /* (USB_UPWRCINV) Register Mask  */


/* -------- USB_UIR : (USB Offset: 0x200) (R/W 32) USB Interrupt Register -------- */
#define USB_UIR_URSTIF_DETACHIF_Pos           _UINT32_(0)                                          /* (USB_UIR) (Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode Position */
#define USB_UIR_URSTIF_DETACHIF_Msk           (_UINT32_(0x1) << USB_UIR_URSTIF_DETACHIF_Pos)       /* (USB_UIR) (Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode Mask */
#define USB_UIR_URSTIF_DETACHIF(value)        (USB_UIR_URSTIF_DETACHIF_Msk & (_UINT32_(value) << USB_UIR_URSTIF_DETACHIF_Pos)) /* Assignment of value for URSTIF_DETACHIF in the USB_UIR register */
#define   USB_UIR_URSTIF_DETACHIF_DETECT_Val  _UINT32_(0x1)                                        /* (USB_UIR) (Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module  */
#define   USB_UIR_URSTIF_DETACHIF_NOT_DETECT_Val _UINT32_(0x0)                                        /* (USB_UIR) (Device mode)No USB Reset has occurred / (Host mode)Peripheral detachment was not detected  */
#define USB_UIR_URSTIF_DETACHIF_DETECT        (USB_UIR_URSTIF_DETACHIF_DETECT_Val << USB_UIR_URSTIF_DETACHIF_Pos) /* (USB_UIR) (Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module Position */
#define USB_UIR_URSTIF_DETACHIF_NOT_DETECT    (USB_UIR_URSTIF_DETACHIF_NOT_DETECT_Val << USB_UIR_URSTIF_DETACHIF_Pos) /* (USB_UIR) (Device mode)No USB Reset has occurred / (Host mode)Peripheral detachment was not detected Position */
#define USB_UIR_UERRIF_Pos                    _UINT32_(1)                                          /* (USB_UIR) USB Error Condition Interrupt bit Position */
#define USB_UIR_UERRIF_Msk                    (_UINT32_(0x1) << USB_UIR_UERRIF_Pos)                /* (USB_UIR) USB Error Condition Interrupt bit Mask */
#define USB_UIR_UERRIF(value)                 (USB_UIR_UERRIF_Msk & (_UINT32_(value) << USB_UIR_UERRIF_Pos)) /* Assignment of value for UERRIF in the USB_UIR register */
#define   USB_UIR_UERRIF_ERROR_Val            _UINT32_(0x1)                                        /* (USB_UIR) Unmasked error condition has occurred  */
#define   USB_UIR_UERRIF_NO_ERROR_Val         _UINT32_(0x0)                                        /* (USB_UIR) Unmasked error condition has not occurred  */
#define USB_UIR_UERRIF_ERROR                  (USB_UIR_UERRIF_ERROR_Val << USB_UIR_UERRIF_Pos)     /* (USB_UIR) Unmasked error condition has occurred Position */
#define USB_UIR_UERRIF_NO_ERROR               (USB_UIR_UERRIF_NO_ERROR_Val << USB_UIR_UERRIF_Pos)  /* (USB_UIR) Unmasked error condition has not occurred Position */
#define USB_UIR_SOFIF_Pos                     _UINT32_(2)                                          /* (USB_UIR) SOF Token Interrupt bit Position */
#define USB_UIR_SOFIF_Msk                     (_UINT32_(0x1) << USB_UIR_SOFIF_Pos)                 /* (USB_UIR) SOF Token Interrupt bit Mask */
#define USB_UIR_SOFIF(value)                  (USB_UIR_SOFIF_Msk & (_UINT32_(value) << USB_UIR_SOFIF_Pos)) /* Assignment of value for SOFIF in the USB_UIR register */
#define   USB_UIR_SOFIF_SOF_RCVE_Val          _UINT32_(0x1)                                        /* (USB_UIR) SOF token received by the peripheral or the SOF threshold reached by the host  */
#define   USB_UIR_SOFIF_NO_SOF_Val            _UINT32_(0x0)                                        /* (USB_UIR) SOF token was not received nor threshold reached  */
#define USB_UIR_SOFIF_SOF_RCVE                (USB_UIR_SOFIF_SOF_RCVE_Val << USB_UIR_SOFIF_Pos)    /* (USB_UIR) SOF token received by the peripheral or the SOF threshold reached by the host Position */
#define USB_UIR_SOFIF_NO_SOF                  (USB_UIR_SOFIF_NO_SOF_Val << USB_UIR_SOFIF_Pos)      /* (USB_UIR) SOF token was not received nor threshold reached Position */
#define USB_UIR_TRNIF_Pos                     _UINT32_(3)                                          /* (USB_UIR) Token Processing Complete Interrupt bit Position */
#define USB_UIR_TRNIF_Msk                     (_UINT32_(0x1) << USB_UIR_TRNIF_Pos)                 /* (USB_UIR) Token Processing Complete Interrupt bit Mask */
#define USB_UIR_TRNIF(value)                  (USB_UIR_TRNIF_Msk & (_UINT32_(value) << USB_UIR_TRNIF_Pos)) /* Assignment of value for TRNIF in the USB_UIR register */
#define   USB_UIR_TRNIF_READY_Val             _UINT32_(0x1)                                        /* (USB_UIR) Processing of current token is complete; a read of the UxSTAT register will provide endpoint information  */
#define   USB_UIR_TRNIF_NOT_READY_Val         _UINT32_(0x0)                                        /* (USB_UIR) Processing of current token not complete  */
#define USB_UIR_TRNIF_READY                   (USB_UIR_TRNIF_READY_Val << USB_UIR_TRNIF_Pos)       /* (USB_UIR) Processing of current token is complete; a read of the UxSTAT register will provide endpoint information Position */
#define USB_UIR_TRNIF_NOT_READY               (USB_UIR_TRNIF_NOT_READY_Val << USB_UIR_TRNIF_Pos)   /* (USB_UIR) Processing of current token not complete Position */
#define USB_UIR_IDLEIF_Pos                    _UINT32_(4)                                          /* (USB_UIR) Idle Detect Interrupt bit Position */
#define USB_UIR_IDLEIF_Msk                    (_UINT32_(0x1) << USB_UIR_IDLEIF_Pos)                /* (USB_UIR) Idle Detect Interrupt bit Mask */
#define USB_UIR_IDLEIF(value)                 (USB_UIR_IDLEIF_Msk & (_UINT32_(value) << USB_UIR_IDLEIF_Pos)) /* Assignment of value for IDLEIF in the USB_UIR register */
#define   USB_UIR_IDLEIF_IDLE_Val             _UINT32_(0x1)                                        /* (USB_UIR) Idle condition detected (constant Idle state of 3 ms or more)  */
#define   USB_UIR_IDLEIF_NOT_IDLE_Val         _UINT32_(0x0)                                        /* (USB_UIR) No Idle condition detected  */
#define USB_UIR_IDLEIF_IDLE                   (USB_UIR_IDLEIF_IDLE_Val << USB_UIR_IDLEIF_Pos)      /* (USB_UIR) Idle condition detected (constant Idle state of 3 ms or more) Position */
#define USB_UIR_IDLEIF_NOT_IDLE               (USB_UIR_IDLEIF_NOT_IDLE_Val << USB_UIR_IDLEIF_Pos)  /* (USB_UIR) No Idle condition detected Position */
#define USB_UIR_RESUMEIF_Pos                  _UINT32_(5)                                          /* (USB_UIR) Resume Interrupt bit Position */
#define USB_UIR_RESUMEIF_Msk                  (_UINT32_(0x1) << USB_UIR_RESUMEIF_Pos)              /* (USB_UIR) Resume Interrupt bit Mask */
#define USB_UIR_RESUMEIF(value)               (USB_UIR_RESUMEIF_Msk & (_UINT32_(value) << USB_UIR_RESUMEIF_Pos)) /* Assignment of value for RESUMEIF in the USB_UIR register */
#define   USB_UIR_RESUMEIF_K_STATE_Val        _UINT32_(0x1)                                        /* (USB_UIR) K-State is observed on the D+ or D- pin for 2.5 s  */
#define   USB_UIR_RESUMEIF_NORMAL_Val         _UINT32_(0x0)                                        /* (USB_UIR) K-State is not observed  */
#define USB_UIR_RESUMEIF_K_STATE              (USB_UIR_RESUMEIF_K_STATE_Val << USB_UIR_RESUMEIF_Pos) /* (USB_UIR) K-State is observed on the D+ or D- pin for 2.5 s Position */
#define USB_UIR_RESUMEIF_NORMAL               (USB_UIR_RESUMEIF_NORMAL_Val << USB_UIR_RESUMEIF_Pos) /* (USB_UIR) K-State is not observed Position */
#define USB_UIR_ATTACHIF_Pos                  _UINT32_(6)                                          /* (USB_UIR) Peripheral Attach Interrupt bit Position */
#define USB_UIR_ATTACHIF_Msk                  (_UINT32_(0x1) << USB_UIR_ATTACHIF_Pos)              /* (USB_UIR) Peripheral Attach Interrupt bit Mask */
#define USB_UIR_ATTACHIF(value)               (USB_UIR_ATTACHIF_Msk & (_UINT32_(value) << USB_UIR_ATTACHIF_Pos)) /* Assignment of value for ATTACHIF in the USB_UIR register */
#define   USB_UIR_ATTACHIF_DETECT_Val         _UINT32_(0x1)                                        /* (USB_UIR) Peripheral attachment was detected by the USB module  */
#define   USB_UIR_ATTACHIF_NOT_DETECT_Val     _UINT32_(0x0)                                        /* (USB_UIR) Peripheral attachment was not detected  */
#define USB_UIR_ATTACHIF_DETECT               (USB_UIR_ATTACHIF_DETECT_Val << USB_UIR_ATTACHIF_Pos) /* (USB_UIR) Peripheral attachment was detected by the USB module Position */
#define USB_UIR_ATTACHIF_NOT_DETECT           (USB_UIR_ATTACHIF_NOT_DETECT_Val << USB_UIR_ATTACHIF_Pos) /* (USB_UIR) Peripheral attachment was not detected Position */
#define USB_UIR_STALLIF_Pos                   _UINT32_(7)                                          /* (USB_UIR) STALL Handshake Interrupt bit Position */
#define USB_UIR_STALLIF_Msk                   (_UINT32_(0x1) << USB_UIR_STALLIF_Pos)               /* (USB_UIR) STALL Handshake Interrupt bit Mask */
#define USB_UIR_STALLIF(value)                (USB_UIR_STALLIF_Msk & (_UINT32_(value) << USB_UIR_STALLIF_Pos)) /* Assignment of value for STALLIF in the USB_UIR register */
#define   USB_UIR_STALLIF_HANDSHAKE_Val       _UINT32_(0x1)                                        /* (USB_UIR) A STALL handshake was sent by Peripheral or received by Host during the handshake phase of the transaction  */
#define   USB_UIR_STALLIF_NO_HANDSHAKE_Val    _UINT32_(0x0)                                        /* (USB_UIR) STALL handshake has not been sent  */
#define USB_UIR_STALLIF_HANDSHAKE             (USB_UIR_STALLIF_HANDSHAKE_Val << USB_UIR_STALLIF_Pos) /* (USB_UIR) A STALL handshake was sent by Peripheral or received by Host during the handshake phase of the transaction Position */
#define USB_UIR_STALLIF_NO_HANDSHAKE          (USB_UIR_STALLIF_NO_HANDSHAKE_Val << USB_UIR_STALLIF_Pos) /* (USB_UIR) STALL handshake has not been sent Position */
#define USB_UIR_Msk                           _UINT32_(0x000000FF)                                 /* (USB_UIR) Register Mask  */


