Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UIECLR : (USB Offset: 0x214) (R/W 32)  -------- */
#define USB_UIECLR_RESETVALUE                 _UINT32_(0x00)                                       /*  (USB_UIECLR)   Reset Value */

#define USB_UIECLR_Msk                        _UINT32_(0x00000000)                                 /* (USB_UIECLR) Register Mask  */


/* -------- USB_UIESET : (USB Offset: 0x218) (R/W 32)  -------- */
#define USB_UIESET_RESETVALUE                 _UINT32_(0x00)                                       /*  (USB_UIESET)   Reset Value */

#define USB_UIESET_Msk                        _UINT32_(0x00000000)                                 /* (USB_UIESET) Register Mask  */


/* -------- USB_UIEINV : (USB Offset: 0x21C) (R/W 32)  -------- */
#define USB_UIEINV_RESETVALUE                 _UINT32_(0x00)                                       /*  (USB_UIEINV)   Reset Value */

#define USB_UIEINV_Msk                        _UINT32_(0x00000000)                                 /* (USB_UIEINV) Register Mask  */


/* -------- USB_UEIR : (USB Offset: 0x220) (R/W 32) USB Error Interrupt Status Register -------- */
#define USB_UEIR_PIDEF_Pos                    _UINT32_(0)                                          /* (USB_UEIR) PID Check Failure Flag bit Position */
#define USB_UEIR_PIDEF_Msk                    (_UINT32_(0x1) << USB_UEIR_PIDEF_Pos)                /* (USB_UEIR) PID Check Failure Flag bit Mask */
#define USB_UEIR_PIDEF(value)                 (USB_UEIR_PIDEF_Msk & (_UINT32_(value) << USB_UEIR_PIDEF_Pos)) /* Assignment of value for PIDEF in the USB_UEIR register */
#define   USB_UEIR_PIDEF_FAIL_Val             _UINT32_(0x1)                                        /* (USB_UEIR) PID check failed  */
#define   USB_UEIR_PIDEF_PASS_Val             _UINT32_(0x0)                                        /* (USB_UEIR) PID check passed  */
#define USB_UEIR_PIDEF_FAIL                   (USB_UEIR_PIDEF_FAIL_Val << USB_UEIR_PIDEF_Pos)      /* (USB_UEIR) PID check failed Position */
#define USB_UEIR_PIDEF_PASS                   (USB_UEIR_PIDEF_PASS_Val << USB_UEIR_PIDEF_Pos)      /* (USB_UEIR) PID check passed Position */
#define USB_UEIR_CRC5EF_EOFEF_Pos             _UINT32_(1)                                          /* (USB_UEIR) (Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit Position */
#define USB_UEIR_CRC5EF_EOFEF_Msk             (_UINT32_(0x1) << USB_UEIR_CRC5EF_EOFEF_Pos)         /* (USB_UEIR) (Device mode)CRC5 Host Error Flag bit / (Host mode)EOF Error Flag bit Mask */
#define USB_UEIR_CRC5EF_EOFEF(value)          (USB_UEIR_CRC5EF_EOFEF_Msk & (_UINT32_(value) << USB_UEIR_CRC5EF_EOFEF_Pos)) /* Assignment of value for CRC5EF_EOFEF in the USB_UEIR register */
#define   USB_UEIR_CRC5EF_EOFEF_ERROR_Val     _UINT32_(0x1)                                        /* (USB_UEIR) (Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected  */
#define   USB_UEIR_CRC5EF_EOFEF_NO_ERROR_Val  _UINT32_(0x0)                                        /* (USB_UEIR) (Device mode)Token packet accepted / (Host mode)No EOF error condition  */
#define USB_UEIR_CRC5EF_EOFEF_ERROR           (USB_UEIR_CRC5EF_EOFEF_ERROR_Val << USB_UEIR_CRC5EF_EOFEF_Pos) /* (USB_UEIR) (Device mode)Token packet rejected due to CRC5 error / (Host mode)EOF error condition detected Position */
#define USB_UEIR_CRC5EF_EOFEF_NO_ERROR        (USB_UEIR_CRC5EF_EOFEF_NO_ERROR_Val << USB_UEIR_CRC5EF_EOFEF_Pos) /* (USB_UEIR) (Device mode)Token packet accepted / (Host mode)No EOF error condition Position */
#define USB_UEIR_CRC16EF_Pos                  _UINT32_(2)                                          /* (USB_UEIR) CRC16 Failure Flag bit Position */
#define USB_UEIR_CRC16EF_Msk                  (_UINT32_(0x1) << USB_UEIR_CRC16EF_Pos)              /* (USB_UEIR) CRC16 Failure Flag bit Mask */
#define USB_UEIR_CRC16EF(value)               (USB_UEIR_CRC16EF_Msk & (_UINT32_(value) << USB_UEIR_CRC16EF_Pos)) /* Assignment of value for CRC16EF in the USB_UEIR register */
#define   USB_UEIR_CRC16EF_ERROR_Val          _UINT32_(0x1)                                        /* (USB_UEIR) Data packet rejected due to CRC16 error  */
#define   USB_UEIR_CRC16EF_NO_ERROR_Val       _UINT32_(0x0)                                        /* (USB_UEIR) Data packet accepted  */
#define USB_UEIR_CRC16EF_ERROR                (USB_UEIR_CRC16EF_ERROR_Val << USB_UEIR_CRC16EF_Pos) /* (USB_UEIR) Data packet rejected due to CRC16 error Position */
#define USB_UEIR_CRC16EF_NO_ERROR             (USB_UEIR_CRC16EF_NO_ERROR_Val << USB_UEIR_CRC16EF_Pos) /* (USB_UEIR) Data packet accepted Position */
#define USB_UEIR_DFN8EF_Pos                   _UINT32_(3)                                          /* (USB_UEIR) Data Field Size Error Flag bit Position */
#define USB_UEIR_DFN8EF_Msk                   (_UINT32_(0x1) << USB_UEIR_DFN8EF_Pos)               /* (USB_UEIR) Data Field Size Error Flag bit Mask */
#define USB_UEIR_DFN8EF(value)                (USB_UEIR_DFN8EF_Msk & (_UINT32_(value) << USB_UEIR_DFN8EF_Pos)) /* Assignment of value for DFN8EF in the USB_UEIR register */
#define   USB_UEIR_DFN8EF_NOT_INTEGRAL_Val    _UINT32_(0x1)                                        /* (USB_UEIR) Data field received is not an integral number of bytes  */
#define   USB_UEIR_DFN8EF_INTEGRAL_Val        _UINT32_(0x0)                                        /* (USB_UEIR) Data field received is an integral number of bytes  */
#define USB_UEIR_DFN8EF_NOT_INTEGRAL          (USB_UEIR_DFN8EF_NOT_INTEGRAL_Val << USB_UEIR_DFN8EF_Pos) /* (USB_UEIR) Data field received is not an integral number of bytes Position */
#define USB_UEIR_DFN8EF_INTEGRAL              (USB_UEIR_DFN8EF_INTEGRAL_Val << USB_UEIR_DFN8EF_Pos) /* (USB_UEIR) Data field received is an integral number of bytes Position */
#define USB_UEIR_BTOEF_Pos                    _UINT32_(4)                                          /* (USB_UEIR) Bus Turnaround Time-Out Error Flag bit Position */
#define USB_UEIR_BTOEF_Msk                    (_UINT32_(0x1) << USB_UEIR_BTOEF_Pos)                /* (USB_UEIR) Bus Turnaround Time-Out Error Flag bit Mask */
#define USB_UEIR_BTOEF(value)                 (USB_UEIR_BTOEF_Msk & (_UINT32_(value) << USB_UEIR_BTOEF_Pos)) /* Assignment of value for BTOEF in the USB_UEIR register */
#define   USB_UEIR_BTOEF_TIMEOUT_Val          _UINT32_(0x1)                                        /* (USB_UEIR) Bus turnaround time-out has occurred  */
#define   USB_UEIR_BTOEF_NO_TIMEOUT_Val       _UINT32_(0x0)                                        /* (USB_UEIR) No bus turnaround time-out  */
#define USB_UEIR_BTOEF_TIMEOUT                (USB_UEIR_BTOEF_TIMEOUT_Val << USB_UEIR_BTOEF_Pos)   /* (USB_UEIR) Bus turnaround time-out has occurred Position */
#define USB_UEIR_BTOEF_NO_TIMEOUT             (USB_UEIR_BTOEF_NO_TIMEOUT_Val << USB_UEIR_BTOEF_Pos) /* (USB_UEIR) No bus turnaround time-out Position */
#define USB_UEIR_DMAEF_Pos                    _UINT32_(5)                                          /* (USB_UEIR) DMA Error Flag bit Position */
#define USB_UEIR_DMAEF_Msk                    (_UINT32_(0x1) << USB_UEIR_DMAEF_Pos)                /* (USB_UEIR) DMA Error Flag bit Mask */
#define USB_UEIR_DMAEF(value)                 (USB_UEIR_DMAEF_Msk & (_UINT32_(value) << USB_UEIR_DMAEF_Pos)) /* Assignment of value for DMAEF in the USB_UEIR register */
#define   USB_UEIR_DMAEF_ERROR_Val            _UINT32_(0x1)                                        /* (USB_UEIR) USB DMA error condition detected  */
#define   USB_UEIR_DMAEF_NO_ERROR_Val         _UINT32_(0x0)                                        /* (USB_UEIR) No DMA error  */
#define USB_UEIR_DMAEF_ERROR                  (USB_UEIR_DMAEF_ERROR_Val << USB_UEIR_DMAEF_Pos)     /* (USB_UEIR) USB DMA error condition detected Position */
#define USB_UEIR_DMAEF_NO_ERROR               (USB_UEIR_DMAEF_NO_ERROR_Val << USB_UEIR_DMAEF_Pos)  /* (USB_UEIR) No DMA error Position */
#define USB_UEIR_BMXEF_Pos                    _UINT32_(6)                                          /* (USB_UEIR) Bus Matrix Error Flag bit Position */
#define USB_UEIR_BMXEF_Msk                    (_UINT32_(0x1) << USB_UEIR_BMXEF_Pos)                /* (USB_UEIR) Bus Matrix Error Flag bit Mask */
#define USB_UEIR_BMXEF(value)                 (USB_UEIR_BMXEF_Msk & (_UINT32_(value) << USB_UEIR_BMXEF_Pos)) /* Assignment of value for BMXEF in the USB_UEIR register */
#define   USB_UEIR_BMXEF_ERROR_Val            _UINT32_(0x1)                                        /* (USB_UEIR) BVCI access initiated on BMX returned response error  */
#define   USB_UEIR_BMXEF_NO_ERROR_Val         _UINT32_(0x0)                                        /* (USB_UEIR) No address error  */
#define USB_UEIR_BMXEF_ERROR                  (USB_UEIR_BMXEF_ERROR_Val << USB_UEIR_BMXEF_Pos)     /* (USB_UEIR) BVCI access initiated on BMX returned response error Position */
#define USB_UEIR_BMXEF_NO_ERROR               (USB_UEIR_BMXEF_NO_ERROR_Val << USB_UEIR_BMXEF_Pos)  /* (USB_UEIR) No address error Position */
#define USB_UEIR_BTSEF_Pos                    _UINT32_(7)                                          /* (USB_UEIR) Bit Stuff Error Flag bit Position */
#define USB_UEIR_BTSEF_Msk                    (_UINT32_(0x1) << USB_UEIR_BTSEF_Pos)                /* (USB_UEIR) Bit Stuff Error Flag bit Mask */
#define USB_UEIR_BTSEF(value)                 (USB_UEIR_BTSEF_Msk & (_UINT32_(value) << USB_UEIR_BTSEF_Pos)) /* Assignment of value for BTSEF in the USB_UEIR register */
#define   USB_UEIR_BTSEF_ERROR_Val            _UINT32_(0x1)                                        /* (USB_UEIR) Packet rejected due to bit stuff error  */
#define   USB_UEIR_BTSEF_NO_ERROR_Val         _UINT32_(0x0)                                        /* (USB_UEIR) Packet accepted  */
#define USB_UEIR_BTSEF_ERROR                  (USB_UEIR_BTSEF_ERROR_Val << USB_UEIR_BTSEF_Pos)     /* (USB_UEIR) Packet rejected due to bit stuff error Position */
#define USB_UEIR_BTSEF_NO_ERROR               (USB_UEIR_BTSEF_NO_ERROR_Val << USB_UEIR_BTSEF_Pos)  /* (USB_UEIR) Packet accepted Position */
#define USB_UEIR_Msk                          _UINT32_(0x000000FF)                                 /* (USB_UEIR) Register Mask  */


