Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UCONSET : (USB Offset: 0x258) (R/W 32)  -------- */
#define USB_UCONSET_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UCONSET)   Reset Value */

#define USB_UCONSET_Msk                       _UINT32_(0x00000000)                                 /* (USB_UCONSET) Register Mask  */


/* -------- USB_UCONINV : (USB Offset: 0x25C) (R/W 32)  -------- */
#define USB_UCONINV_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UCONINV)   Reset Value */

#define USB_UCONINV_Msk                       _UINT32_(0x00000000)                                 /* (USB_UCONINV) Register Mask  */


/* -------- USB_UADDR : (USB Offset: 0x260) (R/W 32) USB Address Register -------- */
#define USB_UADDR_DEVADDR_Pos                 _UINT32_(0)                                          /* (USB_UADDR)  Position */
#define USB_UADDR_DEVADDR_Msk                 (_UINT32_(0x7F) << USB_UADDR_DEVADDR_Pos)            /* (USB_UADDR)  Mask */
#define USB_UADDR_DEVADDR(value)              (USB_UADDR_DEVADDR_Msk & (_UINT32_(value) << USB_UADDR_DEVADDR_Pos)) /* Assignment of value for DEVADDR in the USB_UADDR register */
#define USB_UADDR_LSPDEN_Pos                  _UINT32_(7)                                          /* (USB_UADDR) Low Speed Enable Indicator bit Position */
#define USB_UADDR_LSPDEN_Msk                  (_UINT32_(0x1) << USB_UADDR_LSPDEN_Pos)              /* (USB_UADDR) Low Speed Enable Indicator bit Mask */
#define USB_UADDR_LSPDEN(value)               (USB_UADDR_LSPDEN_Msk & (_UINT32_(value) << USB_UADDR_LSPDEN_Pos)) /* Assignment of value for LSPDEN in the USB_UADDR register */
#define   USB_UADDR_LSPDEN_LOW_SPEED_Val      _UINT32_(0x1)                                        /* (USB_UADDR) Next token command to be executed at Low Speed  */
#define   USB_UADDR_LSPDEN_FULL_SPEED_Val     _UINT32_(0x0)                                        /* (USB_UADDR) Next token command to be executed at Full Speed  */
#define USB_UADDR_LSPDEN_LOW_SPEED            (USB_UADDR_LSPDEN_LOW_SPEED_Val << USB_UADDR_LSPDEN_Pos) /* (USB_UADDR) Next token command to be executed at Low Speed Position */
#define USB_UADDR_LSPDEN_FULL_SPEED           (USB_UADDR_LSPDEN_FULL_SPEED_Val << USB_UADDR_LSPDEN_Pos) /* (USB_UADDR) Next token command to be executed at Full Speed Position */
#define USB_UADDR_Msk                         _UINT32_(0x000000FF)                                 /* (USB_UADDR) Register Mask  */


/* -------- USB_UADDRCLR : (USB Offset: 0x264) (R/W 32)  -------- */
#define USB_UADDRCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UADDRCLR)   Reset Value */

#define USB_UADDRCLR_Msk                      _UINT32_(0x00000000)                                 /* (USB_UADDRCLR) Register Mask  */


/* -------- USB_UADDRSET : (USB Offset: 0x268) (R/W 32)  -------- */
#define USB_UADDRSET_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UADDRSET)   Reset Value */

#define USB_UADDRSET_Msk                      _UINT32_(0x00000000)                                 /* (USB_UADDRSET) Register Mask  */


/* -------- USB_UADDRINV : (USB Offset: 0x26C) (R/W 32)  -------- */
#define USB_UADDRINV_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UADDRINV)   Reset Value */

#define USB_UADDRINV_Msk                      _UINT32_(0x00000000)                                 /* (USB_UADDRINV) Register Mask  */


/* -------- USB_UBDTP1 : (USB Offset: 0x270) (R/W 32) USB BDT Page 1 Register -------- */
#define USB_UBDTP1_BDTPTRL_Pos                _UINT32_(1)                                          /* (USB_UBDTP1)  Position */
#define USB_UBDTP1_BDTPTRL_Msk                (_UINT32_(0x7F) << USB_UBDTP1_BDTPTRL_Pos)           /* (USB_UBDTP1)  Mask */
#define USB_UBDTP1_BDTPTRL(value)             (USB_UBDTP1_BDTPTRL_Msk & (_UINT32_(value) << USB_UBDTP1_BDTPTRL_Pos)) /* Assignment of value for BDTPTRL in the USB_UBDTP1 register */
#define USB_UBDTP1_Msk                        _UINT32_(0x000000FE)                                 /* (USB_UBDTP1) Register Mask  */


/* -------- USB_UBDTP1CLR : (USB Offset: 0x274) (R/W 32)  -------- */
#define USB_UBDTP1CLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP1CLR)   Reset Value */

#define USB_UBDTP1CLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP1CLR) Register Mask  */


/* -------- USB_UBDTP1SET : (USB Offset: 0x278) (R/W 32)  -------- */
#define USB_UBDTP1SET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP1SET)   Reset Value */

#define USB_UBDTP1SET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP1SET) Register Mask  */


/* -------- USB_UBDTP1INV : (USB Offset: 0x27C) (R/W 32)  -------- */
#define USB_UBDTP1INV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UBDTP1INV)   Reset Value */

#define USB_UBDTP1INV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UBDTP1INV) Register Mask  */


/* -------- USB_UFRML : (USB Offset: 0x280) ( R/ 32) USB Frame Number Low Register -------- */
#define USB_UFRML_FRML_Pos                    _UINT32_(0)                                          /* (USB_UFRML)  Position */
#define USB_UFRML_FRML_Msk                    (_UINT32_(0xFF) << USB_UFRML_FRML_Pos)               /* (USB_UFRML)  Mask */
#define USB_UFRML_FRML(value)                 (USB_UFRML_FRML_Msk & (_UINT32_(value) << USB_UFRML_FRML_Pos)) /* Assignment of value for FRML in the USB_UFRML register */
#define USB_UFRML_Msk                         _UINT32_(0x000000FF)                                 /* (USB_UFRML) Register Mask  */


/* -------- USB_UFRMLCLR : (USB Offset: 0x284) (R/W 32)  -------- */
#define USB_UFRMLCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMLCLR)   Reset Value */

