Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
#define USB_UFRMLCLR_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMLCLR) Register Mask  */


/* -------- USB_UFRMLSET : (USB Offset: 0x288) (R/W 32)  -------- */
#define USB_UFRMLSET_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMLSET)   Reset Value */

#define USB_UFRMLSET_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMLSET) Register Mask  */


/* -------- USB_UFRMLINV : (USB Offset: 0x28C) (R/W 32)  -------- */
#define USB_UFRMLINV_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMLINV)   Reset Value */

#define USB_UFRMLINV_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMLINV) Register Mask  */


/* -------- USB_UFRMH : (USB Offset: 0x290) ( R/ 32) USB Frame Number High Register -------- */
#define USB_UFRMH_FRMH_Pos                    _UINT32_(0)                                          /* (USB_UFRMH)  Position */
#define USB_UFRMH_FRMH_Msk                    (_UINT32_(0x7) << USB_UFRMH_FRMH_Pos)                /* (USB_UFRMH)  Mask */
#define USB_UFRMH_FRMH(value)                 (USB_UFRMH_FRMH_Msk & (_UINT32_(value) << USB_UFRMH_FRMH_Pos)) /* Assignment of value for FRMH in the USB_UFRMH register */
#define USB_UFRMH_Msk                         _UINT32_(0x00000007)                                 /* (USB_UFRMH) Register Mask  */


/* -------- USB_UFRMHCLR : (USB Offset: 0x294) (R/W 32)  -------- */
#define USB_UFRMHCLR_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMHCLR)   Reset Value */

#define USB_UFRMHCLR_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMHCLR) Register Mask  */


/* -------- USB_UFRMHSET : (USB Offset: 0x298) (R/W 32)  -------- */
#define USB_UFRMHSET_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMHSET)   Reset Value */

#define USB_UFRMHSET_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMHSET) Register Mask  */


/* -------- USB_UFRMHINV : (USB Offset: 0x29C) (R/W 32)  -------- */
#define USB_UFRMHINV_RESETVALUE               _UINT32_(0x00)                                       /*  (USB_UFRMHINV)   Reset Value */

#define USB_UFRMHINV_Msk                      _UINT32_(0x00000000)                                 /* (USB_UFRMHINV) Register Mask  */


/* -------- USB_UTOK : (USB Offset: 0x2A0) (R/W 32) USB Token Register -------- */
#define USB_UTOK_EP_Pos                       _UINT32_(0)                                          /* (USB_UTOK)  Position */
#define USB_UTOK_EP_Msk                       (_UINT32_(0xF) << USB_UTOK_EP_Pos)                   /* (USB_UTOK)  Mask */
#define USB_UTOK_EP(value)                    (USB_UTOK_EP_Msk & (_UINT32_(value) << USB_UTOK_EP_Pos)) /* Assignment of value for EP in the USB_UTOK register */
#define USB_UTOK_PID_Pos                      _UINT32_(4)                                          /* (USB_UTOK) Token Type Indicator bits Position */
#define USB_UTOK_PID_Msk                      (_UINT32_(0xF) << USB_UTOK_PID_Pos)                  /* (USB_UTOK) Token Type Indicator bits Mask */
#define USB_UTOK_PID(value)                   (USB_UTOK_PID_Msk & (_UINT32_(value) << USB_UTOK_PID_Pos)) /* Assignment of value for PID in the USB_UTOK register */
#define   USB_UTOK_PID_OUT_Val                _UINT32_(0x1)                                        /* (USB_UTOK) OUT (TX) token type transaction  */
#define   USB_UTOK_PID_IN_Val                 _UINT32_(0x9)                                        /* (USB_UTOK) IN (RX) token type transaction  */
#define   USB_UTOK_PID_SETUP_Val              _UINT32_(0xD)                                        /* (USB_UTOK) SETUP (TX) token type transaction  */
#define USB_UTOK_PID_OUT                      (USB_UTOK_PID_OUT_Val << USB_UTOK_PID_Pos)           /* (USB_UTOK) OUT (TX) token type transaction Position */
#define USB_UTOK_PID_IN                       (USB_UTOK_PID_IN_Val << USB_UTOK_PID_Pos)            /* (USB_UTOK) IN (RX) token type transaction Position */
#define USB_UTOK_PID_SETUP                    (USB_UTOK_PID_SETUP_Val << USB_UTOK_PID_Pos)         /* (USB_UTOK) SETUP (TX) token type transaction Position */
#define USB_UTOK_Msk                          _UINT32_(0x000000FF)                                 /* (USB_UTOK) Register Mask  */


/* -------- USB_UTOKCLR : (USB Offset: 0x2A4) (R/W 32)  -------- */
#define USB_UTOKCLR_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UTOKCLR)   Reset Value */

#define USB_UTOKCLR_Msk                       _UINT32_(0x00000000)                                 /* (USB_UTOKCLR) Register Mask  */


/* -------- USB_UTOKSET : (USB Offset: 0x2A8) (R/W 32)  -------- */
#define USB_UTOKSET_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UTOKSET)   Reset Value */

#define USB_UTOKSET_Msk                       _UINT32_(0x00000000)                                 /* (USB_UTOKSET) Register Mask  */


/* -------- USB_UTOKINV : (USB Offset: 0x2AC) (R/W 32)  -------- */
#define USB_UTOKINV_RESETVALUE                _UINT32_(0x00)                                       /*  (USB_UTOKINV)   Reset Value */

#define USB_UTOKINV_Msk                       _UINT32_(0x00000000)                                 /* (USB_UTOKINV) Register Mask  */


/* -------- USB_USOF : (USB Offset: 0x2B0) (R/W 32) USB SOF Threshold Register -------- */
#define USB_USOF_CNT_Pos                      _UINT32_(0)                                          /* (USB_USOF) SOF Threshold Value bits Position */
#define USB_USOF_CNT_Msk                      (_UINT32_(0xFF) << USB_USOF_CNT_Pos)                 /* (USB_USOF) SOF Threshold Value bits Mask */
#define USB_USOF_CNT(value)                   (USB_USOF_CNT_Msk & (_UINT32_(value) << USB_USOF_CNT_Pos)) /* Assignment of value for CNT in the USB_USOF register */
#define   USB_USOF_CNT_BYTE64_Val             _UINT32_(0x4A)                                       /* (USB_USOF) 64-byte packet  */
#define   USB_USOF_CNT_BYTE32_Val             _UINT32_(0x2A)                                       /* (USB_USOF) 32-byte packet  */
#define   USB_USOF_CNT_BYTE16_Val             _UINT32_(0x1A)                                       /* (USB_USOF) 16-byte packet  */
#define   USB_USOF_CNT_BYTE8_Val              _UINT32_(0x12)                                       /* (USB_USOF) 8-byte packet  */
#define USB_USOF_CNT_BYTE64                   (USB_USOF_CNT_BYTE64_Val << USB_USOF_CNT_Pos)        /* (USB_USOF) 64-byte packet Position */
#define USB_USOF_CNT_BYTE32                   (USB_USOF_CNT_BYTE32_Val << USB_USOF_CNT_Pos)        /* (USB_USOF) 32-byte packet Position */
#define USB_USOF_CNT_BYTE16                   (USB_USOF_CNT_BYTE16_Val << USB_USOF_CNT_Pos)        /* (USB_USOF) 16-byte packet Position */
#define USB_USOF_CNT_BYTE8                    (USB_USOF_CNT_BYTE8_Val << USB_USOF_CNT_Pos)         /* (USB_USOF) 8-byte packet Position */
#define USB_USOF_Msk                          _UINT32_(0x000000FF)                                 /* (USB_USOF) Register Mask  */


