Microchip-MPLAB-Harmony/csp_apps_pic32cxbz6_wmbz6/apps/can/can_fd_operation_interrupt_timestamp/src/packs/PIC32CX2051BZ62132_DFP/component/usb.h
/* -------- USB_UCNFG1CLR : (USB Offset: 0x2E4) (R/W 32)  -------- */
#define USB_UCNFG1CLR_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UCNFG1CLR)   Reset Value */

#define USB_UCNFG1CLR_Msk                     _UINT32_(0x00000000)                                 /* (USB_UCNFG1CLR) Register Mask  */


/* -------- USB_UCNFG1SET : (USB Offset: 0x2E8) (R/W 32)  -------- */
#define USB_UCNFG1SET_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UCNFG1SET)   Reset Value */

#define USB_UCNFG1SET_Msk                     _UINT32_(0x00000000)                                 /* (USB_UCNFG1SET) Register Mask  */


/* -------- USB_UCNFG1INV : (USB Offset: 0x2EC) (R/W 32)  -------- */
#define USB_UCNFG1INV_RESETVALUE              _UINT32_(0x00)                                       /*  (USB_UCNFG1INV)   Reset Value */

#define USB_UCNFG1INV_Msk                     _UINT32_(0x00000000)                                 /* (USB_UCNFG1INV) Register Mask  */


/* USB register offsets definitions */
#define USB_UEPx_REG_OFST              _UINT32_(0x00)      /* (USB_UEPx) USB Endpoint Control Registers Offset */
#define USB_UEPxCLR_REG_OFST           _UINT32_(0x04)      /* (USB_UEPxCLR)  Offset */
#define USB_UEPxSET_REG_OFST           _UINT32_(0x08)      /* (USB_UEPxSET)  Offset */
#define USB_UEPxINV_REG_OFST           _UINT32_(0x0C)      /* (USB_UEPxINV)  Offset */
#define USB_UOTGIR_REG_OFST            _UINT32_(0x40)      /* (USB_UOTGIR) USB OTG Interrupt Status Register Offset */
#define USB_UOTGIRCLR_REG_OFST         _UINT32_(0x44)      /* (USB_UOTGIRCLR)  Offset */
#define USB_UOTGIRSET_REG_OFST         _UINT32_(0x48)      /* (USB_UOTGIRSET)  Offset */
#define USB_UOTGIRINV_REG_OFST         _UINT32_(0x4C)      /* (USB_UOTGIRINV)  Offset */
#define USB_UOTGIE_REG_OFST            _UINT32_(0x50)      /* (USB_UOTGIE) USB OTG Interrupt Enable Register Offset */
#define USB_UOTGIECLR_REG_OFST         _UINT32_(0x54)      /* (USB_UOTGIECLR)  Offset */
#define USB_UOTGIESET_REG_OFST         _UINT32_(0x58)      /* (USB_UOTGIESET)  Offset */
#define USB_UOTGIEINV_REG_OFST         _UINT32_(0x5C)      /* (USB_UOTGIEINV)  Offset */
#define USB_UOTGSTAT_REG_OFST          _UINT32_(0x60)      /* (USB_UOTGSTAT) USB OTG Status Register Offset */
#define USB_UOTGCON_REG_OFST           _UINT32_(0x70)      /* (USB_UOTGCON) USB OTG Control Register Offset */
#define USB_UOTGCONCLR_REG_OFST        _UINT32_(0x74)      /* (USB_UOTGCONCLR)  Offset */
#define USB_UOTGCONSET_REG_OFST        _UINT32_(0x78)      /* (USB_UOTGCONSET)  Offset */
#define USB_UOTGCONINV_REG_OFST        _UINT32_(0x7C)      /* (USB_UOTGCONINV)  Offset */
#define USB_UPWRC_REG_OFST             _UINT32_(0x80)      /* (USB_UPWRC) USB Power Control Register Offset */
#define USB_UPWRCCLR_REG_OFST          _UINT32_(0x84)      /* (USB_UPWRCCLR)  Offset */
#define USB_UPWRCSET_REG_OFST          _UINT32_(0x88)      /* (USB_UPWRCSET)  Offset */
#define USB_UPWRCINV_REG_OFST          _UINT32_(0x8C)      /* (USB_UPWRCINV)  Offset */
#define USB_UIR_REG_OFST               _UINT32_(0x200)     /* (USB_UIR) USB Interrupt Register Offset */
#define USB_UIRCLR_REG_OFST            _UINT32_(0x204)     /* (USB_UIRCLR)  Offset */
#define USB_UIE_REG_OFST               _UINT32_(0x210)     /* (USB_UIE) USB Interrupt Enable Register Offset */
#define USB_UIECLR_REG_OFST            _UINT32_(0x214)     /* (USB_UIECLR)  Offset */
#define USB_UIESET_REG_OFST            _UINT32_(0x218)     /* (USB_UIESET)  Offset */
#define USB_UIEINV_REG_OFST            _UINT32_(0x21C)     /* (USB_UIEINV)  Offset */
#define USB_UEIR_REG_OFST              _UINT32_(0x220)     /* (USB_UEIR) USB Error Interrupt Status Register Offset */
#define USB_UEIRCLR_REG_OFST           _UINT32_(0x224)     /* (USB_UEIRCLR)  Offset */
#define USB_UEIE_REG_OFST              _UINT32_(0x230)     /* (USB_UEIE) USB Error Interrupt Enable Register Offset */
#define USB_UEIECLR_REG_OFST           _UINT32_(0x234)     /* (USB_UEIECLR)  Offset */
#define USB_UEIESET_REG_OFST           _UINT32_(0x238)     /* (USB_UEIESET)  Offset */
#define USB_UEIEINV_REG_OFST           _UINT32_(0x23C)     /* (USB_UEIEINV)  Offset */
#define USB_USTAT_REG_OFST             _UINT32_(0x240)     /* (USB_USTAT) USB Status Register Offset */
#define USB_USTATCLR_REG_OFST          _UINT32_(0x244)     /* (USB_USTATCLR)  Offset */
#define USB_USTATSET_REG_OFST          _UINT32_(0x248)     /* (USB_USTATSET)  Offset */
#define USB_USTATINV_REG_OFST          _UINT32_(0x24C)     /* (USB_USTATINV)  Offset */
#define USB_UCON_REG_OFST              _UINT32_(0x250)     /* (USB_UCON) USB Control Register Offset */
#define USB_UCONCLR_REG_OFST           _UINT32_(0x254)     /* (USB_UCONCLR)  Offset */
#define USB_UCONSET_REG_OFST           _UINT32_(0x258)     /* (USB_UCONSET)  Offset */
#define USB_UCONINV_REG_OFST           _UINT32_(0x25C)     /* (USB_UCONINV)  Offset */
#define USB_UADDR_REG_OFST             _UINT32_(0x260)     /* (USB_UADDR) USB Address Register Offset */
#define USB_UADDRCLR_REG_OFST          _UINT32_(0x264)     /* (USB_UADDRCLR)  Offset */
#define USB_UADDRSET_REG_OFST          _UINT32_(0x268)     /* (USB_UADDRSET)  Offset */
#define USB_UADDRINV_REG_OFST          _UINT32_(0x26C)     /* (USB_UADDRINV)  Offset */
#define USB_UBDTP1_REG_OFST            _UINT32_(0x270)     /* (USB_UBDTP1) USB BDT Page 1 Register Offset */
#define USB_UBDTP1CLR_REG_OFST         _UINT32_(0x274)     /* (USB_UBDTP1CLR)  Offset */
#define USB_UBDTP1SET_REG_OFST         _UINT32_(0x278)     /* (USB_UBDTP1SET)  Offset */
#define USB_UBDTP1INV_REG_OFST         _UINT32_(0x27C)     /* (USB_UBDTP1INV)  Offset */
#define USB_UFRML_REG_OFST             _UINT32_(0x280)     /* (USB_UFRML) USB Frame Number Low Register Offset */
#define USB_UFRMLCLR_REG_OFST          _UINT32_(0x284)     /* (USB_UFRMLCLR)  Offset */
#define USB_UFRMLSET_REG_OFST          _UINT32_(0x288)     /* (USB_UFRMLSET)  Offset */
#define USB_UFRMLINV_REG_OFST          _UINT32_(0x28C)     /* (USB_UFRMLINV)  Offset */
#define USB_UFRMH_REG_OFST             _UINT32_(0x290)     /* (USB_UFRMH) USB Frame Number High Register Offset */
#define USB_UFRMHCLR_REG_OFST          _UINT32_(0x294)     /* (USB_UFRMHCLR)  Offset */
#define USB_UFRMHSET_REG_OFST          _UINT32_(0x298)     /* (USB_UFRMHSET)  Offset */
#define USB_UFRMHINV_REG_OFST          _UINT32_(0x29C)     /* (USB_UFRMHINV)  Offset */
#define USB_UTOK_REG_OFST              _UINT32_(0x2A0)     /* (USB_UTOK) USB Token Register Offset */
#define USB_UTOKCLR_REG_OFST           _UINT32_(0x2A4)     /* (USB_UTOKCLR)  Offset */
#define USB_UTOKSET_REG_OFST           _UINT32_(0x2A8)     /* (USB_UTOKSET)  Offset */
#define USB_UTOKINV_REG_OFST           _UINT32_(0x2AC)     /* (USB_UTOKINV)  Offset */
#define USB_USOF_REG_OFST              _UINT32_(0x2B0)     /* (USB_USOF) USB SOF Threshold Register Offset */
#define USB_USOFCLR_REG_OFST           _UINT32_(0x2B4)     /* (USB_USOFCLR)  Offset */
#define USB_USOFSET_REG_OFST           _UINT32_(0x2B8)     /* (USB_USOFSET)  Offset */
#define USB_USOFINV_REG_OFST           _UINT32_(0x2BC)     /* (USB_USOFINV)  Offset */
#define USB_UBDTP2_REG_OFST            _UINT32_(0x2C0)     /* (USB_UBDTP2) USB BDT PAGE 2 Register Offset */
#define USB_UBDTP2CLR_REG_OFST         _UINT32_(0x2C4)     /* (USB_UBDTP2CLR)  Offset */
#define USB_UBDTP2SET_REG_OFST         _UINT32_(0x2C8)     /* (USB_UBDTP2SET)  Offset */
#define USB_UBDTP2INV_REG_OFST         _UINT32_(0x2CC)     /* (USB_UBDTP2INV)  Offset */
#define USB_UBDTP3_REG_OFST            _UINT32_(0x2D0)     /* (USB_UBDTP3) USB BDT PAGE 3 Register Offset */
#define USB_UBDTP3CLR_REG_OFST         _UINT32_(0x2D4)     /* (USB_UBDTP3CLR)  Offset */
#define USB_UBDTP3SET_REG_OFST         _UINT32_(0x2D8)     /* (USB_UBDTP3SET)  Offset */
#define USB_UBDTP3INV_REG_OFST         _UINT32_(0x2DC)     /* (USB_UBDTP3INV)  Offset */
#define USB_UCNFG1_REG_OFST            _UINT32_(0x2E0)     /* (USB_UCNFG1) USB Configuration 1 Register Offset */
#define USB_UCNFG1CLR_REG_OFST         _UINT32_(0x2E4)     /* (USB_UCNFG1CLR)  Offset */
#define USB_UCNFG1SET_REG_OFST         _UINT32_(0x2E8)     /* (USB_UCNFG1SET)  Offset */
#define USB_UCNFG1INV_REG_OFST         _UINT32_(0x2EC)     /* (USB_UCNFG1INV)  Offset */

